# Introduction

Using this Python notebook you will:

1.  Understand three Chicago datasets
2.  Load the three datasets into three tables in a SQL Server database
3.  Execute SQL queries to answer assignment questions

## Understand the datasets

To complete the assignment problems in this notebook you will be using three datasets that are available on the city of Chicago's Data Portal:

1.  <a href="https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01">Socioeconomic Indicators in Chicago</a>
2.  <a href="https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01">Chicago Public Schools</a>
3.  <a href="https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01">Chicago Crime Data</a>

### 1. Socioeconomic Indicators in Chicago

This dataset contains a selection of six socioeconomic indicators of public health significance and a “hardship index,” for each Chicago community area, for the years 2008 – 2012.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:
[https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2](https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### 2. Chicago Public Schools

This dataset shows all school level performance data used to create CPS School Report Cards for the 2011-2012 school year. This dataset is provided by the city of Chicago's Data Portal.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:
[https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t](https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### 3. Chicago Crime Data

This dataset reflects reported incidents of crime (with the exception of murders where data exists for each victim) that occurred in the City of Chicago from 2001 to present, minus the most recent seven days.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:
[https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2](https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### Download the datasets

This assignment requires you to have these three tables populated with a subset of the whole datasets.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the links below to download and save the datasets (.CSV files):

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCensusData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01" target="_blank">Chicago Census Data</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01" target="_blank">Chicago Public Schools</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCrimeData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01" target="_blank">Chicago Crime Data</a>

**NOTE:** Ensure you have downloaded the datasets using the links above instead of directly from the Chicago Data Portal. The versions linked here are subsets of the original datasets and have some of the column names modified to be more database friendly which will make it easier to complete this assignment.

### Store the datasets in database tables

To analyze the data using SQL, it first needs to be stored in the database.

**Notice:** Please follow the instructions given by lecture to import data from .csv file to SQL database server

## Import the `pyodbc` Python library

The `pyodbc` [API ](https://pypi.org/project/pyodbc/) provides a variety of useful Python functions for accessing and manipulating data with SQL Server database, including functions for connecting to a database, preparing and issuing SQL statements, fetching rows from result sets, calling stored procedures, committing and rolling back transactions, handling errors, and retrieving metadata.

We import the `pyodbc` library into our Python Application

The following required modules are pre-installed in the Annaconda environment. However if you run this notebook commands in a different Jupyter environment (e.g. Watson Studio) you may need to install these libraries by removing the `#` sign before `!pip` in the code cell below.

In [ ]:
# The library are pre-installed in anaconda enviroment. If error happen when running please uncomment lines below to install them:
# !pip install pyodbc
# !pip install pandas

In [1]:
import pyodbc
import pandas as pd
import warnings

warnings.filterwarnings('ignore')

In [2]:
#Replace the placeholder values with the actuals for your SQL Server connection properties
Server   = "HE170351"
Database = "Assignment_1"
UID      = "<Replace with username if needed>"
PWD      = "<Replace with password if needed>"

connection_str = ("Driver={SQL Server Native Client 11.0};"
                  "Server=" + Server + ";"
                  "Database=" + Database + ";"
                  "Trusted_Connection=yes;")

# connection_str = ("Driver={SQL Server Native Client 11.0};"
#                   "Server="+ Server + ";"
#                   "Database="+ Database + ";"
#                   "UID="+ UID + ";"
#                   "PWD="+ PWD + ";")

try:
    connection = pyodbc.connect(connection_str)
    print ("Connected to SQL database Server:", Server, "\nDatabase: " + Database)
except pyodbc.Error as ex:
    sqlstate = ex.args[1]
    print ("Unable to connect: ", sqlstate)

Connected to SQL database Server: HE170351
Database: Assignment_1

## Problems

Now write python code and execute SQL queries to solve assignment problems

### Problem 1

##### Find the total number of crimes recorded in the CRIME table.

In [3]:
query = "SELECT COUNT(ID) AS NumberOfCrimes FROM dbo.Crimes"
data = pd.read_sql(query, connection)
data

   NumberOfCrimes
0             533

### Problem 2

##### List community areas with per capita income less than 11000.

In [4]:
query = "SELECT COMMUNITY_AREA_NAME, PER_CAPITA_INCOME FROM dbo.Census WHERE PER_CAPITA_INCOME < 11000"
data = pd.read_sql(query, connection)
data

  COMMUNITY_AREA_NAME  PER_CAPITA_INCOME
0         Fuller Park              10432
1           Riverdale               8201
2      South Lawndale              10402
3  West Garfield Park              10934

### Problem 3

##### List all case numbers for crimes  involving minors?(children are not considered minors for the purposes of crime analysis)

In [16]:
query = "SELECT CASE_NUMBER FROM dbo.Crimes WHERE DESCRIPTION LIKE '%minor%'"
data = pd.read_sql(query, connection)
data

  CASE_NUMBER
0    HK238408
1    HL266884

### Problem 4

##### List all kidnapping crimes involving a child?

In [5]:
query = "SELECT * FROM dbo.Crimes WHERE PRIMARY_TYPE LIKE 'KIDNAPPING'"
data = pd.read_sql(query, connection)
data

,ID,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,DOMESTIC,...,DISTRICT,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,LATITUDE,LONGITUDE,LOCATION
0,5276766,HN144152,2007-01-26,050XX W VAN BUREN ST,1792,KIDNAPPING,CHILD ABDUCTION/STRANGER,STREET,False,False,...,15,29,25,20,1143050,1897546,2007,41.874908,-87.750252,"(41.874908413, -87.750249307)"

### Problem 5

##### What kinds of crimes were recorded at schools?

In [7]:
query = "SELECT DISTINCT(PRIMARY_TYPE) FROM dbo.Crimes WHERE LOCATION_DESCRIPTION LIKE '%SCHOOL%'"
data = pd.read_sql(query, connection)
data

             PRIMARY_TYPE
0                 ASSAULT
1                 BATTERY
2         CRIMINAL DAMAGE
3       CRIMINAL TRESPASS
4               NARCOTICS
5  PUBLIC PEACE VIOLATION

### Problem 6

##### List the average safety score for each type of school.

In [10]:
query = "SELECT Elementary_Middle_or_High_School, AVG(SAFETY_SCORE) AS Average_Safety_Score FROM dbo.Schools GROUP BY Elementary_Middle_or_High_School"
data = pd.read_sql(query, connection)
data

  Elementary_Middle_or_High_School  Average_Safety_Score
0                               ES                    49
1                               HS                    49
2                               MS                    48

### Problem 7

##### List 5 community areas with highest % of households below poverty line

In [11]:
query = "SELECT TOP 5 COMMUNITY_AREA_NAME,PERCENT_HOUSEHOLDS_BELOW_POVERTY FROM dbo.Census ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC"
data = pd.read_sql(query, connection)
data

  COMMUNITY_AREA_NAME  PERCENT_HOUSEHOLDS_BELOW_POVERTY
0           Riverdale                         56.500000
1         Fuller Park                         51.200001
2           Englewood                         46.599998
3      North Lawndale                         43.099998
4  East Garfield Park                         42.400002

### Problem 8

##### Which community area is most crime prone?

In [14]:
query = "SELECT TOP 1 C.COMMUNITY_AREA_NAME, COUNT(C.COMMUNITY_AREA_NUMBER) AS NumberOfCaseCrimes FROM dbo.Census C JOIN dbo.Crimes Cr ON C.COMMUNITY_AREA_NUMBER = Cr.COMMUNITY_AREA_NUMBER GROUP BY C.COMMUNITY_AREA_NAME ORDER BY COUNT(C.COMMUNITY_AREA_NUMBER) DESC"
data = pd.read_sql(query, connection)
data

  COMMUNITY_AREA_NAME  NumberOfCaseCrimes
0              Austin                  43

### Problem 9

##### Use a sub-query to find the name of the community area with highest hardship index

In [13]:
query = "SELECT COMMUNITY_AREA_NAME FROM dbo.Census WHERE HARDSHIP_INDEX = (SELECT MAX(HARDSHIP_INDEX) FROM dbo.Census)"
data = pd.read_sql(query, connection)
data

  COMMUNITY_AREA_NAME
0           Riverdale

### Problem 10

##### Use a sub-query to determine the Community Area Name with most number of crimes?

In [15]:
query = "SELECT COMMUNITY_AREA_NAME FROM dbo.Census WHERE COMMUNITY_AREA_NAME = (SELECT TOP 1 C.COMMUNITY_AREA_NAME FROM dbo.Census C JOIN dbo.Crimes Cr ON C.COMMUNITY_AREA_NUMBER = Cr.COMMUNITY_AREA_NUMBER GROUP BY C.COMMUNITY_AREA_NAME ORDER BY COUNT(C.COMMUNITY_AREA_NUMBER) DESC)"
data = pd.read_sql(query, connection)
data

  COMMUNITY_AREA_NAME
0              Austin